[
{"product": "B00L3N4ZR2", "name": "Dick", "name_link": "/gp/profile/amzn1.account.AHBKNO5GHMDEHLMYHHULHEG3KAVQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " August 24, 2018", "stars": "5.0", "title": "Truly good quality coffee rediscovered!", "review": "The title says it all; “Truly good quality coffee rediscovered!”. Lavazza coffee beans/roasts are quality you can taste, and have distinguishable flavor profiles from one roast to the next. If you enjoy espressos and/or black drip coffee, this is where the untainted distinguishable flavors really come through. So far, I have tried and enjoyed their Gran Crema, Gold Selection, and Super Crema, and each one has its own unique flavor profile.After using Lavazza espresso beans for months in my Super Automatic Espresso Machine, I decided to finally use a use a Starbucks gift card I had lying around to purchase a bag of Starbucks espresso roast beans. It was then I realized how bitter and the lack of flavor character their beans have. I have nothing against Starbucks whatsoever, other than their bitter bland coffee roasts. 😉 I have noticed over the years Starbucks’ coffee has become more and more bitter with less and less distinguishable flavor characteristics along the way, and the only noticeable difference between their roasts is the bitterness level. Years ago, I had always enjoyed their Italian roast, Gold Coast, and Verona, among others, but over time I noticed they became more and more bitter, and less and less distinguishable between each roast. Is this because Starbucks is over roasting their beans to mask the lower quality of beans? Are they forced to use lower quality beans because of the volume of beans they must procure to supply their global presence? I would take an educated guess and say, “Yes”.In my opinion, society has become so habitually transfixed with Starbucks, most people don’t know what real/good coffee is anymore, and I'll explain why. Most of the coffee drinks they sell are flavored with various sweeteners, flavors, milk(s), and/or whip creams, etc., so their bitter characterless coffee is masked by all those additives. I mostly drink black drip coffee to enjoy the full raw flavor and characteristics of the coffee beans/blend/roast, which is how good quality beans and roasts are distinguished, but Espresso and black drip coffee drinkers are in the minority. So maybe that is the calculated decision Starbucks had to make.So, the bottom line is, if you want to enjoy good quality coffee/espresso beans that aren’t over roasted and bitter, and have tasty and distinguishable flavor profiles, then Lavazza is certainly a better/recommended option.Try and enjoy each one of their different and distinguishable roasts, and rediscover what truly good quality coffee tastes like. Cheers!"},
{"product": "B00L3N4ZR2", "name": "Mr Sniggleswerth", "name_link": "/gp/profile/amzn1.account.AGNW7B235FLA3XVEHRMSYTFSU5AQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " May 8, 2019", "stars": "5.0", "title": "Human Termite!", "review": "This product is amazing! It fires me up so much that I blacked out, woke up and thought an army of termites buzz-sawed my entire home until........my wife told me.....it....was.....me...... Caffeine good! Buy it! \"SEGA!\""},
{"product": "B00L3N4ZR2", "name": "nezzy42", "name_link": "/gp/profile/amzn1.account.AETTSXL5OXCQCVBNCOPEANPYU4AA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " April 20, 2021", "stars": "5.0", "title": "very good for espresso, highly recommend", "review": "I have been using this since I bought my revile duo temp pro and love it. I had used illy which i thought would be better but it was the worst tasting espresso compared to Lavazza hands down. Comes out smooth and consistent in my lattes, cappuccinos and americanos."},
{"product": "B00L3N4ZR2", "name": "Igetit", "name_link": "/gp/profile/amzn1.account.AGI7YXXVQOH22RBBLWRPS54UYQ4A/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " June 14, 2021", "stars": "5.0", "title": "This Gran Crema Espresso Is The Best coffee that I have had in 10-12 years.", "review": "I use the Harrio brewing method for my morning coffee. This Lavazza does very well and is now my new favorite. Some have commented that this specific coffee is bland or weak. I use an extra coffee scoop to make it to my taste and it works well. I hope to make some espresso with it as soon as I get some oat milk. Extraction should be less than two minutes using the Harrio pour over brewing method. My rating is 13 out of 15 for this coffee."},
{"product": "B00P0ZMWEC", "name": "Chef LaLa", "name_link": "/gp/profile/amzn1.account.AEJ25XB4IQVQPLIJDA4FVD2IL6DQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " September 5, 2019", "stars": "1.0", "title": "Get ready for a blast from the past! Is this Twilight Zone?", "review": "Lavazza coffee is usually incredible, fresh and delicious . I was eager to try their whole beans and the price was great so I ordered. It arrived today with an expiration date of 2/2021. Before opening it, the scent wasn’t very pleasant , it didn’t smell like any of their ground varieties and seemed like it wasn’t fresh. Once I opened it and inhaled, my nostrils filled with an aroma reminiscent of my great grandmothers forgotten coffee from the 1920’s. Reluctantly and with a shrug, I prepared it hoping to be surprised by it’s flavor. SURPRISE, it tastes like the coffee was roasted in the 20’s, prepared in the summer of ‘69 and refrigerated until 9/3/2019, reheated and served today!! It seems the coffee was stored under less than ideal conditions, prior to its arrival at my door. Aside from it being nauseating and undrinkable it is a great deal! ☕️"},
{"product": "B00L3N4ZR2", "name": "W. Ezell", "name_link": "/gp/profile/amzn1.account.AFWQPWLCLUZAQAR4FTE2CPBXGGNQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " April 29, 2020", "stars": "5.0", "title": "My go-to bean", "review": "I've used this for years, I really like the flavor and the crema. I grind my beans with a mini-Mazzer, use a La Spaziale S1 Vivaldi II as my espresso machine. Yes, upscale, but I used these beans even back when I had a cheap HX machine where you had to brew then wait 5 mins to get steam. It just doesn't disappoint. I will say 99% of what I brew is for a cappucino (double, for breakfast, with a biscotti, every day). Friend of mine that was using some fancy 'artisanal' roast tried this as an espresso, he's now using this."},
{"product": "B00L3N4ZR2", "name": "James B Wadsworth", "name_link": "/gp/profile/amzn1.account.AE2U5F5EZMXUL3PKU46SHRXG7X5Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " February 28, 2020", "stars": "5.0", "title": "Superior flavor", "review": "Coffee taste is subjective. My wife and I found Lavazza last yr and it has become our go to brand. We drink it every morning. Both the Espresso and Gran Crème are great. Everyone has an opinion. Take it for what it is worth. We are not coffee snobs. We have used this coffee in our pour over and our French press."},
{"product": "B00P0ZMWEC", "name": "rNox70", "name_link": "/gp/profile/amzn1.account.AHQ2QEXEPUSYWEDWXRVKKGFDRKNQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " March 26, 2021", "stars": "5.0", "title": "Disappointed, I found no imported Italian rocks in mine!", "review": "Lava- zza means Rock of the Volcano in Italian. I'm disappointed, I found no rocks in mine. I searched and search yet somehow I didn't find my hidden prize that many have talked about. I saw the pictures and hope to get one like those I saw but it just didn't happen. My bag was nothing but mostly full nicely roasted beans. When this bag is done I'll order another an try it again. I really want an imported Italian stone."},
{"product": "B00L3N4ZR2", "name": "Daniel J. Cascioppo", "name_link": "/gp/profile/amzn1.account.AGSP6W3PPI2KEJGZZ55K27FZT7IA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " March 13, 2019", "stars": "5.0", "title": "Smooth creamy complex espresso from Italy", "review": "I have always been fond of Lavazza coffee. My biggest complaint is that it is not always as fresh as I like. These beans were very good and we enjoyed them very much."},
{"product": "B00L3N4ZR2", "name": "Janice", "name_link": "/gp/profile/amzn1.account.AH43AJHTBVVEQL7ESXWHVWYV52YQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " December 9, 2021", "stars": "5.0", "title": "Perfect cuppa!", "review": "Lavazza is great. I’ve tried multiple varieties and would recommend all of them. Robust flavor,‘Wake me up” aroma! Light, medium or dark roast whole bean coffee is always great. Choose the roast and flavor profile of you prefer and you’ll be in for a real treat. I’ve always have expiration dates at least a year out, last purchased 12/2021 and the expiration date is 1/2022"},
{"product": "B00P0ZMWEC", "name": "LS", "name_link": "/gp/profile/amzn1.account.AG6JTM2JVWZK2FQLHKJHER6X6XKQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " April 22, 2019", "stars": "5.0", "title": "Smooth, chocolaty, smooth finish and NOT usual Starbucks-Bitter ... YEAH :-D", "review": "Honestly - this is MUCH better than the bitter 3# bags of Starbucks French Roast I used to buy from Costco for years through middle of 2018. I brew about 12# of coffee beans/year to brew regular coffee make using a standard drip coffee maker and a Keurig 1-cup. With this Lavazza Caffe Espresso you'll enjoy a smooth flavor on your taste buds while in your mouth drinking, and as you swallow there will be much less bitter ickiness left on your tongue like Starbucks. BTW, I still search out a Starbucks around town for a cup but at home I prefer better tasting coffee. I'm shifting to this Lavazza and I also found that Peet's Coffee Major Dickason's coffee bean is Excellent and similar to Lavazza. Peets and Lavazza are both Very smooth for a robust, strong flavor coffee."},
{"product": "B00L3N4ZR2", "name": "WALTER von SCHNELLBACHER SCHUMANN", "name_link": "/gp/profile/amzn1.account.AFBRDKEF4W5LHCUKYOX4TSB6WDDA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " September 2, 2021", "stars": "5.0", "title": "A brand of Coffee everyone should try", "review": "one of the best brands of coffee anyone could have. I AM USING Lavazza for years now and this one cover so many good points. It's creamy, strong and so tasty. When i open the jar with the coffee grains my whole kitchen gets a beautiful scent and smells wonderful. taste is incomparable to other brands. Just buy it !"},
{"product": "B005OJ4X32", "name": "Roger ", "name_link": "/gp/profile/amzn1.account.AH6EPUT2C66TLRGQAKBE7GJ6EECA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " June 26, 2018", "stars": "1.0", "title": "Rocks in my coffee too", "review": "I just wanted to leave a quick review to help a potential buyer. I usually buy Espresso Vivace, Doma, or Klatch, but I ran out, and ordered this to try it. I read the negative reviews about Amazon customers finding rocks in their Lavazza beans, so I was a little worried about it. But I thought it was probably pretty rare. Unfortunately, I found Rocks in my coffee too. Part way through the bag I heard the noise and I knew it was a rock. I've had my Mazzer Mini grinder for over a decade, and it's never made that noise before. I turned it off immediately and looked through the ground coffee for the rock. I found a rock about 7mm x 2mm (after it went through the grinder). See photo. There were probably more fragments in the coffee I tossed - before I thought of looking for them. So that made me curious about the rest of the beans. I placed part of the beans in a pot of water, so that the rocks would sink to the bottom. I found one rock and it was about 7mm x 7mm (about 1/4\"). If I found two rocks I am sure there were more. I only looked through a portion of the beans.My grinder burrs are probably damaged - not being designed to grind rocks. I plan to replace them now. The grinder burrs are $50 to $60. I'm researching it now to see if I can install those myself. This turned out to be the most expensive coffee that I ever purchased.I don't get it. I have been buying different Italian roast beans for 15 years and never once had rocks. Lavazza must know about it. They apparantly read the reviews. I don't understand why their quality department allows it, and why they don't fire the suppliers that provide them with these beans. Coffee beans with rocks are presumably less expensive, but there is a cost to losing customers. I will never purchase Lavazza again.Sorry. I meant to keep it short. I still can't believe it. Rocks. In my coffee. How did the coffee taste? Who cares?July 2018 Update: I posted photos of the rocks and the bag with Mfg codes. I sent the photos and MFG codes to Lavazza, as they had requested that when they made their comment.Aug 2018 Update: I was not allowed to reply to the comment from Lavazza, so I just wanted to add this... The MFD is 25/01/2018. The B.B. is 30/12-2019. The B.No is CA25AD. Lavazza never responded to my email that they requested. From reading their comment that we should buy beans directly from Lavazza, I can't tell if they are saying they sell a lower grade of beans to resellers, or that resellers may have counterfeit Lavazza beans."},
{"product": "B00P0ZMWEC", "name": "Masha", "name_link": "/gp/profile/amzn1.account.AEPXIXMQ6ZYSJH4JZBO5HNV7IZCA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " June 1, 2018", "stars": "1.0", "title": "horrible coffee", "review": "This coffee really is the worst Ive ever tried, i have a Breville espresso machine and i have tried Lavazza coffee before and never did i think I would come across one I don't like, but this one was horrible, it didnt brew!!! almost like it clogs up my machine , few drips come through and thats all, Ive tried grinding it may different ways and nothing, if it did drip enough coffee for me it would be way to watered down, this was horrible"},
{"product": "B00L3N4ZR2", "name": "Alfa", "name_link": "/gp/profile/amzn1.account.AF2N7TRV6SLTPZFN4NRLGOB7IGFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " November 5, 2021", "stars": "2.0", "title": "Not so bad, but you can do better", "review": "very light taste for an espresso roast, my automatic espresso maker does get some decent crema but the flavor is just ok. This comes in a pack of 2 so a total of 4.4 pounds, had I just purchased 1 package I would not be reordering. It is not so bad but it is far less than what I expected, maybe it was older?"},
{"product": "B005OJ4X32", "name": "A. H.", "name_link": "/gp/profile/amzn1.account.AE7535RPTHLUN5JOTW4RR7Q75EWA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " October 18, 2015", "stars": "5.0", "title": "A lesson about coffee and Lavazza to understand the review.", "review": "THE BOTTOM LINE: Gran Crema is an EXCELLENT blend of coffee to make cappuccinos and lattes, producing an incredibly velvety crema. The espresso drinker who prefers a stronger taste and full body will also certainly enjoy this roast blend.Tastes: If everyone had the same tastes and liked the same things, there would only be one coffee in the world. Finding the \"perfect\" coffee is a personal decision tailored by your own taste and likes, and even then, many times you want to have something different or change, therefore in finding YOUR perfect coffee, it depends on your present tastes and moods at that one particular moment in time...which can change. My best advice is follow your feelings and have a try at different things to find NOT what you like, but what you DEFINITELY do not like. And most certainly do not buy or force yourself to like something, because others do like it or love it. Buy for you, not for them.Coffee basics: 2 types of beans. Arabica, which have a smoother taste in general but have lighter body and make less crema, and Robusto, which make more crema and have a stronger taste and body but carry more bitterness. Plants are grown in warmer climates all around the globe, and each place yields beans with distinct flavors regardless of the same bean used. The roasting of the coffee, different machines, water quality and grind quality also add to these differences. Tamping (espresso styles) and amount of coffee makes a very minimal difference compared to all the other factors, and everyone gets the hang of it with practice (i.e. no need to focus so much on pressures and exact weight and times). WHAT IS MOST IMPORTANT: the WATER!, the quality of the coffee, the right grind for the style you are making (finer for espresso and Turkish, coarser for other styles), and a good machine for that style, which is NOT synonymous with expensive (stove tops are not). You get these 4 things right, and all the other factors won't matter much, and you will have an excellent coffee every time. The water here where I live is horrible, and so was my coffee, so I had to spend quite a lot on a filtration system for the water.Italian coffee: Our preferred styles are espresso, cappuccino, and latte (it really means milk and the original Italian name is caffè e latte, but we have dropped the \"e\" over time) and all are served hot. In Italy, flavors/things added to these styles are only found in places where tourists are (i.e. no creams, cinnamon, iced, etc) and most Italians do not even consider or have heard of adding anything else, other than sugar. In Italian bars (this is what we call coffee shops in Italy and why they're called baristas) ALL coffee is a blend of arabica and robusta, making them versatile. ALL bars in Italy also use whole milk, typically what we call lunga conservazione which stores at room temperature until opened (hence less refrigeration storing space needed). You might find places that use more than just whole milk in tourist areas, but is not a certainty. Whole milk froths better than other milk. Coffee is quite important in Italy, so much that the price of coffee is strictly regulated and has been, long before the owners of Starbucks were even born.Lavazza: Most sold coffee brand in Italy. Lavazza makes 2 lines of coffee geared to the preferred Italian styles, one for home use, and one commercial, but each and every one of them is different from each other and any coffee in the home line is totally different from any one in the commercial line. The home line consists of:1. Qualità Oro - 100% Arabica beans from a blend of Central America and African highlands. Medium roast.2. Qualità Rossa - 70% Brasilian arabica and 30% African robusta. Medium roast.3. Gran Aroma - 60% arabica and 40% robusta. All Brasilian. Medium roast.4. Gran Crema - 40% South America arabica and 60% Southeast Asia robusta. Dark roast.5. Crema e Aroma - 30% South America arabica and 70% African robusta. Medium roast.Qualità Rossa is the most readily available in Italy and hence the less expensive and most used/sold in Italy also. Qualità Oro is aimed at espresso style, Gran Crema is aimed at cappuccino and latte styles, with Gran Bar and Qualità Rossa being more versatile. Qualità Rossa seems to most to have a balance IN TASTE (smooth vs. strong) between arabica and robusta. The entire Lavazza home line is excellent Italian roast espresso coffee but is best to stick Gran Crema (mixing) and Qualità Oro (straight) for what they're geared for, and in the proper use you will find the correct taste, smoothness, and next to no bitterness, if any at all. They are all superb for use in the right manner and none of them are oily.About me: I definitely do not like bitter or oily coffee (all coffee is oily per se, but I do not like coffee that has a distinct film of oil on top, which you can see at an angle and which is typically bitter coffee). I prefer cappuccinos and \"lattes\", but regardless I like a strong taste and therefore use Gran Crema, but I do enjoy espresso also so I do use Gran Aroma, which still has enough strong taste for my cappuccinos and lattes. My family in Italy in general prefer espressos and use Qualità Oro, but also use Qualità Rossa (much much less). You will only see me at Starbucks in case of dire emergency, which translates to 3 times in 20 years (once after an 18 hour travel marathon in planes). I'm not even mentioning any other coffee places. I use a Gaggia at home and drink tea while I travel. My entire family owns Gaggias. Not because we're married to the brand, but because we have tried plenty others, but Gaggias last us much better than the rest. My mother's must be at least 30 years old. However, one glance at her stove top will convince you it was around before Metusela.Anecdote: I was quite entertained when I learned about the craziness to obsess over tamping pressures, weighing, and stopwatches. Out of curiosity on a British espresso machine that uses no electricity or stove (but you have to have boiling water so you need it anyway), I found a video of this American guy showing the ROK coffee maker which was totally obsessed with this and I learned that it was quite common. I told my mother, who laughed, and shared it at the local bar in her neighborhood the next morning. The barista (our friend) had to call me at 4 a.m. my time (it's ok, mamma has been doing it all these years). He almost didn't believe me. I had to send him youtube links, including the ROK guy. He asked \"Are they crazy? People believe we use scales and stopwatches at the bars?\" About tamping he said it's common sense. It has to be compact enough so that you get the flavor out of the coffee, but not too compact that breaks the pump on the machine."},
{"product": "B00P0ZMWEC", "name": "jenesaisquoi", "name_link": "/gp/profile/amzn1.account.AEC7YGINBJ7LU2JQFGZQSRDB7TRA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " October 28, 2018", "stars": "5.0", "title": "Updated Review: It's Better Than I Originally Thought", "review": "This one was too good to be true. The price was dirt cheap at around $5 a pound on sale. I bought three bags on faith since I've had Lavazza in the past, and I like the Super Crema and Gran Crema. I really like dark roasts, but not this particular blend. If it's on sale it's worth trying.Update 26 Nov 18: Correction, I take back my original review. We were using this coffee in a regular drip machine in the morning. The problem is my wife and I don't agree on the amount of coffee to use when making coffee. Unfortunately for me, she usually makes the coffee to her tastes, which is much weaker than it should be by all rights. On a whim I wanted to have a cup tonight, so I brought out my French press. I put the proper amount of grounds in (double what my wife uses) and WOW! This coffee is wonderful, very smooth and rich. Very nice aroma. It tastes every bit as good as Starbucks House Blend. It looks like I'll have to keep the French press going in the morning separately just for me. My apologies to Lavazza for my previous review."},
{"product": "B005OJ4X32", "name": "Jay F.G.", "name_link": "/gp/profile/amzn1.account.AF56WUYEARRS2M7WKFETGPJUPQRQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " March 15, 2018", "stars": "4.0", "title": "Rocks in bag! Beware for the love of your expensive grinder.", "review": "I'm picky and this coffee passed. I use this in a moka pot and it's great. I use french press also, even better. I would give a 5 star for a mass produced product, if not for the problem. A big problem is, and I have never seen this before, rocks mix in with beans. I'm about an eighth way through my bag and have found d two. The first rock was noticed after my $140 grinder froze with it stuck in the burrs. I had to completely disassemble the machine to pry the rock out. I now have to derock the beans on an old album cover. I learned that trick doing something else back in college. A pain in the rearend, but good coffee with great, thick crema."},
{"product": "B00P0ZMWEC", "name": "QM", "name_link": "/gp/profile/amzn1.account.AFYD63L5JWNZI3JZJWLQYVWP23XA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " September 22, 2016", "stars": "1.0", "title": "Beans or rocks?", "review": "Coffee was fine but a little on the harsh side (not as smooth as Supercrema). Then this rock made its way into the grinder of my super automatic. The grinder is powerful but no match for this. I didn't want to disassemble my machine at 6:15 am but had no choice. Hopefully my gears don't start slipping.I can see no reason why a rock of this size makes it through their process. If this is normal and I have to inspect each bean going into my machine, I'll buy another brand."},
{"product": "B005OJ4X32", "name": "Scott", "name_link": "/gp/profile/amzn1.account.AHY5M3PRTG6NA74RYCQYELHLMS2Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " December 20, 2019", "stars": "1.0", "title": "A Rock in my Coffee", "review": "3/3/20 - yet another rock in my coffee. WTF, Lavazza!!!!!!!!!?This rock was in the most recent bag of this coffee, which I've been buying for over a year on autoship I may now need to look for a different brand, as the rock (pictured) nearly ruined a very expensive burr grinder. Lavazza: get your quality control together!!!"},
{"product": "B00P0ZMWEC", "name": "bitchymitchy", "name_link": "/gp/profile/amzn1.account.AFLZFDBO54XXNYCBLVIAHVN5T3VQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " January 22, 2019", "stars": "4.0", "title": "Updated Review 27Jan19 (Good Coffee) Lingering, Strong, Unpleasant After Taste", "review": "Updating my review, due to my mistake. Poor review below about terrible after taste was in error. Tried the coffee beans for espresso and it made a very good tasting espresso. Previous terrible after taste (from below review) was determined to be sour steamed milk, not the coffee beans. These are good beans with a nice strong taste and smooth finish. I recommend this product.I tried this because of the large amount of good reviews and reasonable price. The after taste is very unpleasant. Almost a metallic taste and lasts a long time. It is just not for me. I like a strong/smooth espresso taste. However, it might be appropriate if you like the crap they sell at Starbuck's where they have to have the strongest most unpleasant taste to come through the $20 worth of frew-frew sugary/crème/spicy junk they put in their drinks and call it coffee."},
{"product": "B005OJ4X32", "name": "littlesong", "name_link": "/gp/profile/amzn1.account.AEXGOR3EFGD5YOEY3IMZVCZKBXLQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " December 27, 2018", "stars": "1.0", "title": "The rock will break your grinder", "review": "I purchased Lavazza Super Crema Whole Bean Coffee Blend, Medium Espresso Roast, 2.2-Pound Bagby Lavazza. The bean is ok, but the rock, which is never expected, brake the grinder of my Breville bes870xl espresso machine. That is a big cost for the bean. Not only the rock, I even find a piece of broken bone of bird. The rock was larger before being broken by the grinder."},
{"product": "B00P0ZMWEC", "name": "Lucas R Cole", "name_link": "/gp/profile/amzn1.account.AHLDAPDGE6LTSQT33ZAKLWQTOISA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " January 16, 2020", "stars": "3.0", "title": "Check beans carefully for foreign objects.", "review": "Great beans, BUT, check the bag for foreign objects. We were running beans through the Jura machine and this little object jammed up the grinder. Had to disassemble the machine, and eventually turn it upside down and shake it to clear the ham. Time will tell if it did any permanent damage. It appears to be a little piece of shell or wood. It’s aggravating worrying now that I have to check over 2.2 lbs of beans before I pour them into the machine. This alone is enough to make me shy away from the brand."},
{"product": "B005OJ4X32", "name": "Natalie P. Hartsell", "name_link": "/gp/profile/amzn1.account.AELANETFIRPJXQ6637IKC7KX3CNQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "location": " the United States ", "date": " December 13, 2017", "stars": "3.0", "title": "Found a rock in the beans", "review": "We love Lavazza at our house. Especially the Super Crema. However, in our most recent bag there was a rock. We found this out during the grinding process in a rather expensive espresso machine. We were able to remove it, but only time will tell if damage was done. I'd recommend inspecting the beans closely before running them through your machine."},
